renesas/rx-driver-package/source/r_irda_sci_rx/r_irda_sci_rx_vx.xx/r_irda_sci_rx/src/targets/irda/rx113/r_irda_sci_rx113.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2024 Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 01.12.2014 1.00     First Release
*              : 27.01.2015 1.01     Chage symbol name of Arguments 
*                                    None change proceedures.
*              : 15.11.2024 1.02     Added WAIT_LOOP comment.
 **********************************************************************************************************************/
/***********************************************************************************************************************
* System Name  : interface file for IrDA fit module.
* File Name    : r_irda_sci_rx113.c
* Version      : 1.02
* Device       : RX
* Abstract     : 
* Tool-Chain   : Renesas RXC Toolchain v3.06.00
* OS           : not use
* H/W Platform : RSKRX113
* Description  : Functions for using IrDA on RX devices. 
* Limitation   : none
 **********************************************************************************************************************/

/***********************************************************************************************************************
Includes <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Access to peripherals and board defines. */
#include "platform.h"

/* Include specifics for chosen MCU.  */
#include "./../r_irda_sci_rx_private.h"
#include "r_irda_sci_rx113_private.h"

/* Defines for IRDA support */
#include "r_irda_sci_rx_if.h"
#include "r_irda_sci_rx_config.h"

#include "r_byteq_if.h"

/***********************************************************************************************************************
Macro definitions
 **********************************************************************************************************************/

/***********************************************************************************************************************
  Private variables and functions
 **********************************************************************************************************************/
/*------- Data and information for each channel -------*/
#if IRDA_SCI_CFG_CH5_INCLUDED

/* Queue buffers */
uint8_t         irda_ch5_tx_buf[IRDA_SCI_CFG_CH5_TX_BUFSIZ];
uint8_t         irda_ch5_rx_buf[IRDA_SCI_CFG_CH5_RX_BUFSIZ];

/* Addresses and setting values for I/O registers, etc. */
//
const irda_sci_ch_rom_t  irda_ch5_rom =
{
    /* Hardware locks for the SCI and the IrDA in the BSP module */
    BSP_LOCK_SCI5,
    BSP_LOCK_IRDA,
    /* Structure for I/O registers in the SCI and IrDA modules */
    (volatile __evenaccess struct st_sci12 *)&SCI5,
    (volatile __evenaccess struct st_irda *)&IRDA,
    /* Module stop registers and bits in the registers */
    &SYSTEM.MSTPCRB.LONG,
    &SYSTEM.MSTPCRC.LONG,
    BIT26_MASK,
    BIT20_MASK,
    /* Interrupt Register */
    &ICU.IPR[IPR_SCI5_RXI5].BYTE,
    &ICU.IR[IR_SCI5_RXI5].BYTE,
    &ICU.IR[IR_SCI5_TXI5].BYTE,
    &ICU.IR[IR_SCI5_TEI5].BYTE,
    &ICU.IR[IR_SCI5_ERI5].BYTE,
    &ICU.IER[IER_SCI5_RXI5].BYTE,
    &ICU.IER[IER_SCI5_TXI5].BYTE,
    &ICU.IER[IER_SCI5_TEI5].BYTE,
    &ICU.IER[IER_SCI5_ERI5].BYTE,
    BIT7_MASK,
    BIT0_MASK,
    BIT1_MASK,
    BIT6_MASK
};

/* Port setting values for pins IRTXD and IRRXD */
const irda_sci_ch_port_rom_t g_irda_sci_ch5_portrom =
{
    /* IRTXD Pin Select */
    IRDA_SCI_CFG_CH5_IRTXD_GP,              /* 0: Port group of IRTXD pin */
    IRDA_SCI_CFG_CH5_IRTXD_PIN,             /* 1: Port bit of IRTXD pin */
    1,                                      /* 2: Pin direction control (IN/OUT) when not selecting the IRTXD pin */
    IRDA_SCI_CFG_CH5_IRTXD_INACTIVE_LEVEL,  /* 3: Pin level when  not selecting the IRTXD pin */
    IRDA_SCI_MPC_IRTXD5_ENABLE,             /* 4: MPC setting data of IRTXD pin */

    /* IRTXD Pin Select */
    IRDA_SCI_CFG_CH5_IRRXD_GP,              /* 0: Port group of IRRXD pin */
    IRDA_SCI_CFG_CH5_IRRXD_PIN,             /* 1: Port bit of IRRXD pin */
    0,                                      /* 2: Pin direction control (IN/OUT) when not selecting the IRRXD pin */
    IRDA_SCI_CFG_CH5_IRRXD_INACTIVE_LEVEL,  /* 3: Pin level when  not selecting the IRRXD pin */
    IRDA_SCI_MPC_IRRXD5_ENABLE              /* 4: MPC setting data of IRRXD pin */
};

/* Channel control handle block */
irda_sci_ch_ctrl_t   irda_ch5_ctrl =
{
    &irda_ch5_rom,                       /* rom info pointer          */
    &g_irda_sci_ch5_portrom,        /* port info pointer         */
    NULL,                           /* Callback function pointer */
    NULL,                           /* Transmit queue handle     */
    NULL,                           /* Receive queue handle      */
    true                            /* Transmit status           */
};
#endif

/*------- Information table for all SCI channels -------*/
/* Handles array */
const irda_sci_hdl_t g_irda_handles[IRDA_SCI_NUM_CH] =
{
            NULL,           /* ch0  */
            NULL,           /* ch1  */
            NULL,           /* ch2  */
            NULL,           /* ch3  */
            NULL,           /* ch4  */
#if IRDA_SCI_CFG_CH5_INCLUDED
            &irda_ch5_ctrl,      /* ch5  */
#else
            NULL,
#endif
            NULL,           /* ch6  */
            NULL,           /* ch7  */
            NULL,           /* ch8  */
            NULL,           /* ch9  */
            NULL,           /* ch10 */
            NULL,           /* ch11 */
            NULL            /* ch12 */
};

/*------- Information table for all SCI channels -------*/
/* ��Boud-Rate divisor info               */
/* BRR = (PCLK/(divisor * baud)) - 1    */
/* abcs=0, divisor = 64*pow(2,2n-1)     */

