renesas/rx-driver-package/source/r_irda_sci_rx/r_irda_sci_rx_vx.xx/r_irda_sci_rx/src/targets/irda/rx113/r_irda_sci_rx113.c
#define NUM_DIVISORS  4
const baud_divisor_t irda_async_baud[NUM_DIVISORS]=
{
    {32,   0},   /* divisor result, n */
    {128,  1},
    {512,  2},
    {2048, 3}
};

const out_width_divisor_t irda_ircks_div[8] =
{
    {16 ,3},        /* div B * 3/16 */
    {2  ,1},        /* div P /2     */
    {4  ,1},        /* div P /4     */
    {8  ,1},        /* div P /8     */
    {16 ,1},        /* div P /16    */
    {32 ,1},        /* div P /32    */
    {64 ,1},        /* div P /64    */
    {128,1}         /* div P /128   */
};

/*------- Global functions -------*/
void                  irda_power_setting(irda_sci_hdl_t const hdl, bool init_or_setting);
irda_sci_err_t        irda_sci_open(uint8_t const           chan,
                                    irda_sci_t * const      p_cfg,
                                    void(* const p_callback)(void *p_args),
                                    irda_sci_hdl_t * const  p_hdl);
void                  irda_sci_close(irda_sci_hdl_t const hdl);

/*------- Private functions -------*/
static irda_sci_err_t irda_sci_init_queues          (uint8_t const chan);
static void           irda_sci_clear_io_register_sci(irda_sci_hdl_t const hdl);
static void           irda_sci_io_setting           (uint8_t* port_sel);
static void           irda_sci_io_mode_setting      (uint8_t* port_sel, bool init_or_setting);
static void           select_ints                   (uint32_t* ints_sel, bool init_or_setting);
static irda_sci_err_t irda_sci_init_bit_rate        (irda_sci_hdl_t const    hdl,
                                                     uint32_t const     pclk,
                                                     irda_sci_t * const  p_cfg);

/***********************************************************************************************************************
* Function Name: irda_power_setting
* Description  : Starts or stops operation of the specified module.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                init_or_setting -
*                    Information of the selected operation for 
*                    the module (start/stop)
* Return Value : none
 **********************************************************************************************************************/
void irda_power_setting(irda_sci_hdl_t const hdl, bool init_or_setting)
{
    volatile  __evenaccess uint32_t *mstp_reg = hdl->rom->mstp;

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    if (TARGET_SETTING == init_or_setting)
    {
        *mstp_reg &= ~hdl->rom->stop_mask;
         mstp_reg++;
        *mstp_reg &= ~hdl->rom->stop_mask_irda;
    }
    else
    {
        *mstp_reg |= hdl->rom->stop_mask;
         mstp_reg++;
        *mstp_reg |= hdl->rom->stop_mask_irda;
    }
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    return;
}

/***********************************************************************************************************************
* Function Name: irda_sci_open
* Description  : Initialization for using the IRDA
*
* NOTE: The associated port must be configured/initialized prior to
*       calling this function.
*
* Arguments    :  irda_sci_ch_ctrl_t -
*                    handle for channel (pointer to channel control block)
* Return Value : IRDA_SCI_SUCCESS -
*                    channel opened successfully
 **********************************************************************************************************************/
irda_sci_err_t irda_sci_open(uint8_t const      chan,
                             irda_sci_t * const  p_cfg,
                             void               (* const p_callback)(void *p_args),
                             irda_sci_hdl_t * const  p_hdl)
{
    irda_sci_err_t  err = IRDA_SCI_SUCCESS;
    volatile __evenaccess const irda_sci_ch_rom_t * p_prom = g_irda_handles[chan]->rom;

    /* I/O port setting (Hi-Z -> Set the state it was in when you release the port) */
    irda_sci_io_setting((uint8_t*)&(g_irda_handles[chan]->port_rom->irrxd_port_gr));
    irda_sci_io_setting((uint8_t*)&(g_irda_handles[chan]->port_rom->irtxd_port_gr));

    /* Initialize transmit status flag */
    g_irda_handles[chan]->tx_idle = true;

    /* Set data polarity and Serial I/O pins are used for IrDA data communication. */
    p_prom->regs_irda->IRCR.BYTE = (uint8_t)(0x80 | (IRDA_SCI_CFG_CH5_IRTXD_INACTIVE_LEVEL << 3) |
                          (IRDA_SCI_CFG_CH5_IRRXD_INACTIVE_LEVEL <<2 ));

    /* Configure SMR for asynchronous mode, single processor, 8bit , Non-parity, and 2 stop-bit */
    p_prom->regs->SMR.BYTE = (uint8_t)0x08;

    /* Setup clock for Baud-Rate */
    err = irda_sci_init_bit_rate(g_irda_handles[chan], BSP_PCLKB_HZ, p_cfg);
    if (IRDA_SCI_SUCCESS != err)
    {
        return err;
    }

    /* Set Interrupt Source Priority for ERI, RXI, TXI, and TEI. */
    *p_prom->ipr = p_cfg->int_priority;

    /* Set the Callback function to be called when ERI, RXI, and TEI interrupt occurs */
    g_irda_handles[chan]->callback = p_callback;

    /* Configuration and initialization of the queue of the sending and receiving */
    err = irda_sci_init_queues(chan);
    if (err != IRDA_SCI_SUCCESS)
    {
        return err;
    }

    /* Transmit Enable */
    p_prom->regs->SCR.BIT.TE = 1;

    /* Set IRRXD mode of the I/O port */
    irda_sci_io_mode_setting((uint8_t*)&(g_irda_handles[chan]->port_rom->irrxd_port_gr),TARGET_SETTING);
    
    /* wait over[18 / (16 * bit-rate)] */
    R_BSP_SoftwareDelay(((1000000/p_cfg->baud_rate) * 18 / 16),BSP_DELAY_MICROSECS);

    p_prom->regs_irda->IRCR.BYTE = (uint8_t)(0x80 | (p_cfg->clk_out_width<<4) |
                     (IRDA_SCI_CFG_CH5_IRTXD_INACTIVE_LEVEL << 3) | (IRDA_SCI_CFG_CH5_IRRXD_INACTIVE_LEVEL <<2 ));

    /* Receive Interrupt Enable */
    select_ints((uint32_t*)&(p_prom->ir_rxi),TARGET_SETTING);
    select_ints((uint32_t*)&(p_prom->ir_eri),TARGET_SETTING);
    p_prom->regs->SCR.BIT.RIE = 1;           /* Receive Interrupt Enable */

    /* Receive Enable */
    p_prom->regs->SCR.BIT.RE = 1;

    /* Set IRTXD mode of the I/O port */
    irda_sci_io_mode_setting((uint8_t*)&(g_irda_handles[chan]->port_rom->irtxd_port_gr),TARGET_SETTING);

