renesas/rx-driver-package/source/r_irda_sci_rx/r_irda_sci_rx_vx.xx/r_irda_sci_rx/src/targets/irda/rx113/r_irda_sci_rx113.c
    /* Transmit Interrupt Enable */
    select_ints((uint32_t*)&(p_prom->ir_txi),TARGET_SETTING);
    p_prom->regs->SCR.BIT.TIE = 1;
    /* The TEI interrupt is enabled if the transmit queue is empty when the TXI interrupt occurs, */
    /* and the TEI interrupt is disabled in the TEI interrupt handling.  */
    return (err);
}

/***********************************************************************************************************************
* Function Name: irda_sci_close
* Description  : Stops the IRDA function. This processing includes the 
*                initialization for SCI chX used.
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : None
 **********************************************************************************************************************/
void irda_sci_close(irda_sci_hdl_t const hdl)
{

    volatile __evenaccess const irda_sci_ch_rom_t * p_prom = hdl->rom;

    /* I/O port Refresh (Set the state it was in when you release the port) */
    irda_sci_io_setting((uint8_t*)&(hdl->port_rom->irtxd_port_gr));
    irda_sci_io_setting((uint8_t*)&(hdl->port_rom->irrxd_port_gr));

    /* Set IN/OUT Port mode of the I/O port */
    irda_sci_io_mode_setting((uint8_t*)&(hdl->port_rom->irtxd_port_gr),TARGET_STOP);

    /* Transmit Interrupt Disable  & Transmit End Interrupt Disable */
    p_prom->regs->SCR.BIT.TEIE = 0;
    p_prom->regs->SCR.BIT.TIE = 0;
    select_ints((uint32_t*)&(p_prom->ir_tei),TARGET_STOP);
    select_ints((uint32_t*)&(p_prom->ir_txi),TARGET_STOP);

    /* Receive Disable */
    p_prom->regs->SCR.BIT.RE = 0;

    /* Receive Interrupt Disable */
    p_prom->regs->SCR.BIT.RIE = 0;
    select_ints((uint32_t*)&(p_prom->ir_rxi),TARGET_STOP);
    select_ints((uint32_t*)&(p_prom->ir_eri),TARGET_STOP);

    /* Initialize IrDA Clock Select*/
    p_prom->regs_irda->IRCR.BYTE &= 0x8F;

    /* Set IN/OUT Port mode of the I/O port */
    irda_sci_io_mode_setting((uint8_t*)&(hdl->port_rom->irrxd_port_gr),TARGET_STOP);

    /* Transmit Disable */
    p_prom->regs->SCR.BIT.TE = 0;

    /* Initialization of SCI Register */
    irda_sci_clear_io_register_sci(hdl);

    /* Clear Interrupt flags */
    *p_prom->ir_rxi = 0;
    *p_prom->ir_eri = 0;
    *p_prom->ir_txi = 0;
    *p_prom->ir_tei = 0;

    /* Clear Interrupt Source Priority for ERI, RXI, TXI, and TEI. */
    *p_prom->ipr = 0;

    /* Serial I/O pins are used for SCI. */
    p_prom->regs_irda->IRCR.BYTE = 0x00;

}

/***********************************************************************************************************************
* Function Name: sci_enable_ints
* Description  : Clears the specified interrupt request flag and enables or 
*                disables the interrupt request.
*                interrupts.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                priority -
*                    priority for interrupts
* Return Value : none
 **********************************************************************************************************************/
static void select_ints(uint32_t* ints_sel, bool init_or_setting)
{
    volatile  __evenaccess uint32_t  * select_ir;
    volatile  __evenaccess uint32_t  * select_ien;
    uint8_t select_ien_mask = *(ints_sel+8);

    select_ir = (volatile  __evenaccess uint32_t*)*ints_sel;
    select_ien = (volatile  __evenaccess uint32_t*)*(ints_sel+4);

    if (TARGET_SETTING == init_or_setting)
    {
        /* Clear Interrupt Request flag */
        (uint8_t)(*select_ir) = 0;
        /* Notifies the CPU of the interrupt request. */
        (uint8_t)(*select_ien) |= (uint8_t)select_ien_mask;
    }
    else
    {
        /* Clear Interrupt Request flag */
        (*select_ir) = 0;
        /* Not notify the CPU of the interrupt request. */
        (uint8_t)(*select_ien) &= (uint8_t)~ select_ien_mask;
    }
}

/***********************************************************************************************************************
* Outline      : Sets the state when the specified pin is not active state.
* Function Name: irda_sci_mpc_setting
* Description  : Set IRDA_SCI function pin controller.
* Arguments    : uint8_t* port_sel ; Port select infomation
* Return Value : None
 **********************************************************************************************************************/
static void irda_sci_io_setting(uint8_t* port_sel)
{
    volatile uint8_t __evenaccess * const p_pdr  = ((&PORT0.PDR.BYTE) + *(port_sel));
    volatile uint8_t __evenaccess * const p_podr = ((&PORT0.PDR.BYTE) + 0x20 + *(port_sel));

    (*p_podr) |= ((*(port_sel+3) << *(port_sel+1)));        /* Port holds output data. */
    (*p_pdr)  |= ((*(port_sel+2) << *(port_sel+1)));        /* Port Direction */

}

/***********************************************************************************************************************
* Outline      : Switches the specified pin mode.
* Function Name: irda_sci_io_mode_setting
* Description  : Set IRDA_SCI function pin controller.
* Arguments    : uint8_t* port_sel ; Port select infomation
*              : init_or_setting   : Specifies the mode for the pin to be selected.
* Return Value : None
 **********************************************************************************************************************/
static void irda_sci_io_mode_setting(uint8_t* port_sel, bool init_or_setting)
{
    volatile uint8_t __evenaccess * const p_pmr  = ((&PORT0.PDR.BYTE) + 0x60 + *(port_sel));
    volatile uint8_t __evenaccess * const ppfs = ((((&MPC.PWPR.BYTE) + 0x21 + (*(port_sel) * 8)) + *(port_sel+1)));

    if (TARGET_SETTING == init_or_setting)
    {
        /* Select Port Function Control */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);  /* Enables the PFS register writing.        */
        (*ppfs) = *(port_sel+4);
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);   /* Disables the PFS register writing.       */

        /* Control Port Mode (Functions) */
        (*p_pmr)  |= ((1U << *(port_sel+1)));
        /*Reads the same I/O register (since the Delay function may be called in next processing).  */
        if ((*p_pmr & (1U << *(port_sel+1))) == 1)
        {
            nop();
        }
    }
    else
    {
        /* Select Port Function Control */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);  /* Enables the PFS register writing.        */
        (*ppfs) = IRDA_SCI_MPC_IRTXD_DISABLE;
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);   /* Disables the PFS register writing.       */

        /* Control Port Mode (Port) */
        (*p_pmr)  &= (~(1U << *(port_sel+1)));
    }

