renesas/rx-driver-package/source/r_irda_sci_rx/r_irda_sci_rx_vx.xx/r_irda_sci_rx/src/targets/irda/rx113/r_irda_sci_rx113.c
}

/***********************************************************************************************************************
* Outline      : Reset SCI I/O register
* Function Name: irda_sci_clear_io_register
* Description  : Reset SCI I/O register.
* Arguments    : irda_sci_ch_ctrl_t const hdl     ;   IrDA handler
* Return Value : None
 **********************************************************************************************************************/
static void irda_sci_clear_io_register_sci(irda_sci_hdl_t const hdl)
{
    volatile  __evenaccess struct st_sci12 * p_prom = hdl->rom->regs;

    /* Initializes SCI I/O register */
    p_prom->SMR.BYTE     = IRDA_SCI_SMR_INIT;
    p_prom->SCR.BYTE     = IRDA_SCI_SCR_INIT;
    p_prom->SCMR.BYTE    = IRDA_SCI_SCMR_INIT;
    p_prom->BRR          = IRDA_SCI_BRR_INIT;
    p_prom->SEMR.BYTE    = IRDA_SCI_SEMR_INIT;
    p_prom->SNFR.BYTE    = IRDA_SCI_SNFR_INIT;
    p_prom->SIMR1.BYTE   = IRDA_SCI_SIMR1_INIT;
    p_prom->SIMR2.BYTE   = IRDA_SCI_SIMR2_INIT;
    p_prom->SIMR3.BYTE   = IRDA_SCI_SIMR3_INIT;
    p_prom->SISR.BYTE    = IRDA_SCI_SISR_INIT;
    p_prom->SPMR.BYTE    = IRDA_SCI_SPMR_INIT;
}

/***********************************************************************************************************************
* Function Name: sci_init_queues
* Description  : Configuration and initialization of the queue of the sending
*                and receiving
* Arguments    : chan -
*                    channel (ptr to chan control block)
* Return Value : SCI_SUCCESS -
*                    channel initialized successfully
*                SCI_ERR_QUEUE_UNAVAILABLE -
*                    no queue control blocks available
 **********************************************************************************************************************/
static irda_sci_err_t irda_sci_init_queues(uint8_t const  chan)
{
    byteq_err_t      ret1 = BYTEQ_ERR_INVALID_ARG;
    byteq_err_t      ret2 = BYTEQ_ERR_INVALID_ARG;
    irda_sci_err_t   err    = IRDA_SCI_SUCCESS;

    /* channel number verified as legal prior to calling this function */
    switch (chan)
    {
#if IRDA_SCI_CFG_CH5_INCLUDED
    case (IRDA_SCI_CH5):
        ret1 = R_BYTEQ_Open(irda_ch5_tx_buf, IRDA_SCI_CFG_CH5_TX_BUFSIZ, &g_irda_handles[IRDA_SCI_CH5]->u_tx_data);
        ret2 = R_BYTEQ_Open(irda_ch5_rx_buf, IRDA_SCI_CFG_CH5_RX_BUFSIZ, &g_irda_handles[IRDA_SCI_CH5]->u_rx_data);
        break;
#endif
    }

    if ((ret1 != BYTEQ_SUCCESS) || (ret2 != BYTEQ_SUCCESS))
    {
        err = IRDA_SCI_ERR_QUEUE_UNAVAILABLE;
    }

    return err;
}

/***********************************************************************************************************************
* Function Name: irda_sci_init_bit_rate
* Description  :Configures settings based on the specified peripheral clock
*               and communication rate. Verifies if the high pulse width
*               is within the available range. 
* Arguments    : hdl -
*                    Handle for channel (ptr to chan control block)
*                pclk -
*                    Peripheral clock speed; e.g. 24000000 for 24MHz
*                baud -
*                    Baud rate; 19200, 57600, 115200, etc.
* Return Value : IRDA_SCI_SUCCESS -
*                    Baud-Rate was correctly set
*                IRDA_SCI_ERR_INVALID_ARG -
*                    Paramater is Invalid value or The baud rate is not set correctly
 **********************************************************************************************************************/
static irda_sci_err_t irda_sci_init_bit_rate(irda_sci_hdl_t const  hdl,
                                             uint32_t const pclk,
                                             irda_sci_t * const  p_cfg)
{
    uint32_t i;
    uint32_t num_divisors = NUM_DIVISORS;
    uint32_t ratio;
    uint32_t tmp;
    uint32_t irda_tmp1;
    uint32_t irda_tmp2;
    uint32_t baud = p_cfg->baud_rate;
    irda_sci_err_t  err = IRDA_SCI_SUCCESS;

    baud_divisor_t const *p_baud_info = irda_async_baud;

#if (SCI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((pclk == 0) || (baud == 0))
    {
        return (IRDA_SCI_ERR_INVALID_ARG);
    }
#endif

    /* FIND the divisor ; CKS and ABCS Value is associated in the table. */
    /* BRR must be 255 or less                                */
    /* the "- 1" is ignored in some steps for approximations  */
    /* BRR = (PCLK/(divisor * baud)) - 1                      */
    /* BRR = (ratio / divisor) - 1                            */

    ratio = pclk/baud;
    /* WAIT_LOOP */
    for(i=0; i < num_divisors; i++)
    {
        if (ratio < (uint32_t)(p_baud_info[i].divisor * 256))
        {
            break;
        }
    }
    if (i == num_divisors)
    {
        return (IRDA_SCI_ERR_INVALID_ARG);
    }
    

    /* Adjusts the value set to the BRR register by rounding and carry. */
    /* divide ratio by only half the divisor and see if odd number */
    tmp = ratio/((uint32_t)p_baud_info[i].divisor/2);
    /* if odd, "round up" by ignoring -1; divide by 2 again for rest of divisor */
    if (0x01 == (tmp & 0x01))
    {
        tmp = (uint8_t)tmp/2;
    }
    else
    {
        tmp = (uint8_t)(tmp/2)-1;
    }

    /* Verifies whether the high pulse width, which is specified with the output pulse width,*/
    /* is within the available range for communiaction.                                      */
    if (IRDA_SCI_OUT_WIDTH_3_16 != p_cfg->clk_out_width)
    {
        irda_tmp1 = (pclk / 1000 / irda_ircks_div[p_cfg->clk_out_width].w_denominator);
        irda_tmp2 = baud / (0.2125 * 1000);
        if((709 <= irda_tmp1)||(irda_tmp1 <= irda_tmp2))
        {
            return (IRDA_SCI_ERR_INVALID_ARG);
        }
    }

    /* Set CSK,ABCS bit and BRR register */
    hdl->rom->regs->BRR = (uint8_t)tmp;
    hdl->rom->regs->SEMR.BIT.ABCS = 0;
    hdl->rom->regs->SMR.BIT.CKS = p_baud_info[i].cks;

    return (err);
}

