renesas/rx-driver-package/source/r_irda_sci_rx/r_irda_sci_rx_vx.xx/r_irda_sci_rx/src/targets/irda/rx113/r_irda_sci_rx113.c
/***********************************************************************************************************************
* Function Name: sci5_txi5_isr
* Description  : TXI interrupt routine
* Arguments    : none
* Return Value : none
 **********************************************************************************************************************/
#if IRDA_SCI_CFG_CH5_INCLUDED
#pragma interrupt sci5_txi5_isr(vect=VECT(SCI5,TXI5))
static void sci5_txi5_isr(void)
{
    irda_txi_handler(&irda_ch5_ctrl);
}
#endif

/***********************************************************************************************************************
* Function Name: IRDA_SCI_CFG_CH5_INCLUDED
* Description  : TEI interrupt routine
* Arguments    : none
* Return Value : none
 **********************************************************************************************************************/
#if IRDA_SCI_CFG_CH5_INCLUDED
#pragma interrupt sci5_tei5_isr(vect=VECT(SCI5,TEI5))
static void sci5_tei5_isr(void)
{
    irda_tei_handler(&irda_ch5_ctrl);
}
#endif


/***********************************************************************************************************************
* Function Name: sci5_rxi5_isr
* Description  : RXI interrupt routine
* Arguments    : none
* Return Value : none
 **********************************************************************************************************************/
#if IRDA_SCI_CFG_CH5_INCLUDED
#pragma interrupt sci5_rxi5_isr(vect=VECT(SCI5,RXI5))
static void sci5_rxi5_isr(void)
{
    irda_rxi_handler(&irda_ch5_ctrl);
}
#endif

/***********************************************************************************************************************
* Function Name: sci5_eri5_isr
* Description  : ERI interrupt routine
* Arguments    : none
* Return Value : none
 **********************************************************************************************************************/
#if IRDA_SCI_CFG_CH5_INCLUDED
#pragma interrupt sci5_eri5_isr(vect=VECT(SCI5,ERI5))
static void sci5_eri5_isr(void)
{
    irda_eri_handler(&irda_ch5_ctrl);
}
#endif

/* End of File */
